//
//انا حولت اظبت السالب وشغاله جرب كده هتشتغل بس في مشكلة تانية قبلتي لو حولت مثلا
//-1-1 
//هيطلع ايرور مش عارف ليه لسا بس اتوقع من نفس المشكلة بتاعت الاكتر من اوبريشن
//شيك كده علي الفنكشن بتاعت 
//oper
//حتي صلحت برضو الحتي لو انت مثلا عاوز تكتب 
//5**5
//هيطلع ماسج تقله ان فيه ايرور
//اعتقد حاليا التركيز في ان نقدر نشغل اكتر من عملية ونصلح الايرور بتاع السالب لما تطرح علي رقم سالب
//متمسحش الكود بتاعي عدل عليه عشان تعبت عليه 
//شوف الي عاوز يتعدل وعدله
//وسيب الباقي وابقا شوف لو هتعمل كلاس تاني ولا حاجة في العامليات الجديدة الي عاوز تضفها وبرضو نشغل زراير الساين والقظاين والاقواس وكده
//لو عندك افكار تانية ممكن تضفها عادي ولو هتعمل شاشة تانية اعملها حاجة كروكي تشتغل عليها وانا ابقا اظبطهالك
//بس متصعبش الدنيا اوي يعني عشان الناس التانية تفهم او علي الاقل نشوف اسئلته هتبقا اذاي لباقي التيم
//
//برضو هيثم قال انه هيعم حجات جديدة كويسة ذي ان يعرف الرقم ده 
//even 
//odd 
//او حجات تانية بقا ممكن برضو تبقا افكار كويسة
